
-- Лабораторная работа №1
-- Вариант 29
-- Заполнение таблиц данными

-- Таблица 1. Пути

INSERT INTO tracks
(depot_no, track_no, purpose,
 track_length, is_free, is_electrified)
VALUES
(1, 1, 'Стоянка', 120.50, FALSE, TRUE),
(1, 2, 'Стоянка', 110.00, TRUE, TRUE),
(1, 3, 'Ремонт', 85.00, FALSE, FALSE),
(1, 4, 'Мойка', 75.00, TRUE, TRUE),
(2, 1, 'Стоянка', 130.00, FALSE, TRUE),
(2, 2, 'Ремонт', 95.50, TRUE, FALSE),
(2, 3, 'Стоянка', 125.00, FALSE, TRUE),
(3, 1, 'Стоянка', 115.00, TRUE, TRUE),
(3, 2, 'Ремонт', 90.00, TRUE, FALSE),
(3, 3, 'Стоянка', 140.00, FALSE, TRUE),
(3, 4, 'Стоянка', 100.50, TRUE, TRUE);

-- Таблица 2. Занятость путей

INSERT INTO track_occupancy
(depot_no, track_no, arrival_time,
 departure_time, tram_no, additional_info)
VALUES
(1, 1, '2026-10-21 09:00', NULL,
 101, 'На стоянке'),

(1, 2, '2026-10-20 10:00', '2026-10-20 11:00',
 102, 'Выезд завершен'),

(1, 3, '2026-10-21 08:00', NULL,
 103, 'На ремонте'),

(1, 4, '2026-10-20 12:00', '2026-10-20 13:00',
 104, 'Мойка завершена'),

(2, 1, '2026-10-21 07:00', NULL,
 105, 'На стоянке'),

(2, 2, '2026-10-20 09:00', '2026-10-20 15:00',
 106, 'Ремонт завершен'),

(2, 3, '2026-10-21 11:00', NULL,
 107, 'На стоянке'),

(3, 1, '2026-10-20 08:00', '2026-10-20 10:00',
 108, 'Выезд завершен'),

(3, 2, '2026-10-19 09:00', '2026-10-19 14:00',
 109, 'Проверка завершена'),

(3, 3, '2026-10-21 10:00', NULL,
 110, 'На стоянке');
